"""
作者:张杰
时间:2024年03月11日
"""
# 一.请问以下几个选项哪几个是字典(多选，标点符号都是英文)
# 1.{ ' ' :1,1:' ' }
# 2. {}
# 3.{1,':', 10}
# 4.{[1]: 'q'} 附加题：
# 5. {(1,): {'w': (1)}}
# 6. {{}: ['q', 2]}
# 7.{{1, 2}: {}}

# 二.除第3小问之外做完后都要打印字典
# 1.创建一个空字典dict1
# 2.在dict1中添加键值对'矿泉水':2, '槟榔':25, '酒':1500
# 3.通过键获取dict1中的值：1500
# 4.通过键把'酒'对应的值改为1000
# 5.（附加题）获取dict1里所有的键（调用keys方法），并以列表格式打印
# 6.清空dict1
# 提示:第一题可以用type方法验证
# 1.字典：1，2，5
# 2.1
dict1 ={} # dict1=dict()
print(dict1)
# 2.2
dict1= {'矿泉水': 2, '槟榔': 25, '酒': 1500}
dict1['烟']=10
dict1.setdefault('茶叶',1)
print(dict1)
# 2.3
print(dict1['酒'])
# 2.4
dict1['酒'] = 1000
print(dict1)
# 2.5
list1 = list(dict1.keys())
print(list1)
# 2.6
dict1.clear()
print(dict1)